{
    "first-name": "Gourav",
    "last-name": "Raj",
    "social-media-links": {
        "github": "https://github.com/gouravrajbit",
        "linkedin": "https://www.linkedin.com/in/gouravrajdev/",
        "twitter": "https://twitter.com/DRGGourav",
        "instagram": "https://www.instagram.com/gourav_raj_/"
    },
    "intros": [
        "I am a Full-Stack Developer"
    ],
    "bio": [
        "I build services from the ground up, developing robust backends and designing elegant and responsive UI/UX interfaces. I solve problems present in e-commerce ecosystem and reduce shopper friction at ",
        "Swym",
        "."
    ],
    "wip": true,
    "wip-text": "This web app is under work in progress as I work on it mostly during weekends. You can track the project progress at ",
    "project-link": "https://github.com/gouravrajbit/dot-portfolio",
    "about-text": [
        "Hello! My name is Gourav and I love building software that solves real world problems. Engineering has been a passion of mine since childhood, and I've made my way into the field of software engineering.",
        "I am based out of Ranchi, Jharkhand, India and have pursued my Graduation from ",
        "Birla Institue of Technology, Mesra",
        " with 8.33 GPA.",
        "My main focus these days is building solutions for e-commerce and enhance it's experience for shoppers and merchants at ",
        "Swym",
        ".",
        "Outside of my professional commitments, I engage in web application development to both refine my technical skills and stay updated with emerging technologies in the industry. Additionally, I participate in hackathons, earning recognition and prizes for my contributions. More recently, I have also begun contributing to open source projects."
    ],
    "skills": [
        "Typescript",
        "Clojure",
        "NodeJS",
        "React",
        "JavaScript (ES6+)",
        "C/C++"
    ],
    "experience": [
        {
            "name": "Swym",
            "url": "swym.it",
            "role": "Associate Software Engineer",
            "start": "Jan 2022",
            "end": "Present",
            "paras": [
                "Currently contributing to the development of scalable service abstractions, empowering developers to seamlessly integrate third-party platform solutions and significantly enhancing overall application functionality.",
                "Developed various Shopify apps, enhancing e-commerce for shoppers and merchants through seamless integration and customization.",
                "Played a pivotal role in enhancing our company's Shopify apps by seamlessly integrating external platforms such as Gorgias CRM and Yotpo, boosting the app's functionality and offering merchants an enriched e-commerce experience.",
                "Successfully automated a manual workflow, reducing app installation time from days to minutes.",
                "Tasked with the responsibility of ensuring the smooth migration of data across different tiers and overseeing the efficient import of customer data into our systems.",
                "Designed and implemented a customized tool automating the customer data import process, resulting in a substantial boost to the productivity of the customer support team."
            ]
        }
    ]
}