{
    "first-name": "Gourav",
    "last-name": "Raj",
    "social-media-links": {
        "github": "https://github.com/gouravrajbit",
        "linkedin": "https://www.linkedin.com/in/gouravrajdev/",
        "twitter": "https://twitter.com/DRGGourav",
        "instagram": "https://www.instagram.com/gourav_raj_/"
    },
    "intros": [
        "I am a Full-Stack Developer"
    ],
    "bio": [
        "I build services from the ground up, developing robust backends and designing elegant and responsive UI/UX interfaces. I solve problems present in e-commerce ecosystem and reduce shopper friction at ",
        "Swym",
        "."
    ],
    "wip": true,
    "wip-text": "This web app is under work in progress as I work on it mostly during weekends. You can track the project progress at ",
    "project-link": "https://github.com/gouravrajbit/dot-portfolio",
    "about-text": [
        "Hello! My name is Gourav and I love building software that solves real world problems. Engineering has been a passion of mine since childhood, and I've made my way into the field of software engineering.",
        "I am based out of Ranchi, Jharkhand, India and have pursued my Graduation from ",
        "Birla Institue of Technology, Mesra",
        " with 8.33 GPA.",
        "My main focus these days is building solutions for e-commerce and enhance it's experience for shoppers and merchants at ",
        "Swym",
        ".",
        "Outside of my professional commitments, I engage in web application development to both refine my technical skills and stay updated with emerging technologies in the industry. Additionally, I participate in hackathons, earning recognition and prizes for my contributions. More recently, I have also begun contributing to open source projects."
    ],
    "skills": [
        "Typescript",
        "Clojure",
        "NodeJS",
        "React",
        "JavaScript (ES6+)",
        "C/C++"
    ],
    "experience": [
        {
            "name": "Swym",
            "url": "swym.it",
            "paras": [
                " I have a strong background in Shopify app development and e-commerce enhancement, with a focus on seamless integration and customization for shoppers and merchants. I played a key role in improving our company's Shopify apps by integrating external platforms like Gorgias CRM and Yotpo, significantly enhancing the app's functionality and providing a better e-commerce experience for merchants. Notably, I successfully automated a time-consuming manual workflow, reducing app installation time from days to mere minutes. Additionally, I managed data migration and the efficient import of customer data across different tiers.",
                "Furthermore, I am currently contributing to the development of scalable service abstractions that empower developers to seamlessly integrate third-party platform solutions, resulting in a substantial boost in overall application functionality. I also designed and implemented a customized tool to automate the customer data import process, greatly improving the productivity of the customer support team. Moreover, I tackled and resolved bugs in both frontend and backend services of the Wishlist Plus app, ensuring the seamless functionality of the systems."
            ]
        }
    ]
}